MARS-engineers/Robotrix-Board/boards.txt
# WARNING - DO NOT EDIT THIS FILE, IT IS MACHINE GENERATED
#           To change something here, edit tools/makeboards.py and
#           run 'python3 makeboards.py > ../boards.txt' to regenerate

menu.BoardModel=Model
menu.variantchip=Chip Variant
menu.flash=Flash Size
menu.psramcs=PSRAM CS
menu.psram=PSRAM Size
menu.psramfreq=PSRAM Speed
menu.freq=CPU Speed
menu.arch=CPU Architecture
menu.opt=Optimize
menu.os=Operating System
menu.profile=Profiling
menu.rtti=RTTI
menu.stackprotect=Stack Protector
menu.exceptions=C++ Exceptions
menu.dbgport=Debug Port
menu.dbglvl=Debug Level
menu.boot2=Boot Stage 2
menu.wificountry=WiFi Region
menu.usbstack=USB Stack
menu.espwifitype=ESP Wifi Type
menu.ipbtstack=IP/Bluetooth Stack
menu.uploadmethod=Upload Method

# -----------------------------------
# Generic RP2040
# -----------------------------------
generic.name=Generic RP2040
generic.vid.0=0x2e8a
generic.pid.0=0xf00a
generic.vid.1=0x2e8a
generic.pid.1=0xf10a
generic.upload_port.0.vid=0x2e8a
generic.upload_port.0.pid=0xf00a
generic.upload_port.1.vid=0x2e8a
generic.upload_port.1.pid=0xf10a
generic.build.usbvid=-DUSBD_VID=0x2e8a
generic.build.usbpid=-DUSBD_PID=0xf00a
generic.build.usbpwr=-DUSBD_MAX_POWER_MA=250
generic.build.board=GENERIC_RP2040
generic.build.mcu=cortex-m0plus
generic.build.chip=rp2040
generic.build.toolchain=arm-none-eabi
generic.build.toolchainpkg=pqt-gcc
generic.build.toolchainopts=-march=armv6-m -mcpu=cortex-m0plus -mthumb
generic.build.uf2family=--family rp2040
generic.build.variant=generic
generic.upload.maximum_size=16777216
generic.upload.wait_for_upload_port=true
generic.upload.erase_cmd=
generic.serial.disableDTR=false
generic.serial.disableRTS=false
generic.build.f_cpu=125000000
generic.build.led=
generic.build.core=rp2040
generic.build.ldscript=memmap_default.ld
generic.build.boot2=boot2_generic_03h_4_padded_checksum
generic.build.usb_manufacturer="Generic"
generic.build.usb_product="RP2040"
generic.menu.flash.2097152_0=2MB (no FS)
generic.menu.flash.2097152_0.upload.maximum_size=2093056
generic.menu.flash.2097152_0.build.flash_total=2097152
generic.menu.flash.2097152_0.build.flash_length=2093056
generic.menu.flash.2097152_0.build.eeprom_start=270528512
generic.menu.flash.2097152_0.build.fs_start=270528512
generic.menu.flash.2097152_0.build.fs_end=270528512
generic.menu.flash.2097152_65536=2MB (Sketch: 1984KB, FS: 64KB)
generic.menu.flash.2097152_65536.upload.maximum_size=2027520
generic.menu.flash.2097152_65536.build.flash_total=2097152
generic.menu.flash.2097152_65536.build.flash_length=2027520
generic.menu.flash.2097152_65536.build.eeprom_start=270528512
generic.menu.flash.2097152_65536.build.fs_start=270462976
generic.menu.flash.2097152_65536.build.fs_end=270528512
generic.menu.flash.2097152_131072=2MB (Sketch: 1920KB, FS: 128KB)
generic.menu.flash.2097152_131072.upload.maximum_size=1961984
generic.menu.flash.2097152_131072.build.flash_total=2097152
generic.menu.flash.2097152_131072.build.flash_length=1961984
generic.menu.flash.2097152_131072.build.eeprom_start=270528512
generic.menu.flash.2097152_131072.build.fs_start=270397440
generic.menu.flash.2097152_131072.build.fs_end=270528512
generic.menu.flash.2097152_262144=2MB (Sketch: 1792KB, FS: 256KB)
generic.menu.flash.2097152_262144.upload.maximum_size=1830912
generic.menu.flash.2097152_262144.build.flash_total=2097152
generic.menu.flash.2097152_262144.build.flash_length=1830912
generic.menu.flash.2097152_262144.build.eeprom_start=270528512
generic.menu.flash.2097152_262144.build.fs_start=270266368
generic.menu.flash.2097152_262144.build.fs_end=270528512
generic.menu.flash.2097152_524288=2MB (Sketch: 1536KB, FS: 512KB)
generic.menu.flash.2097152_524288.upload.maximum_size=1568768
generic.menu.flash.2097152_524288.build.flash_total=2097152
generic.menu.flash.2097152_524288.build.flash_length=1568768
generic.menu.flash.2097152_524288.build.eeprom_start=270528512
generic.menu.flash.2097152_524288.build.fs_start=270004224
generic.menu.flash.2097152_524288.build.fs_end=270528512
generic.menu.flash.2097152_1048576=2MB (Sketch: 1MB, FS: 1MB)
generic.menu.flash.2097152_1048576.upload.maximum_size=1044480
generic.menu.flash.2097152_1048576.build.flash_total=2097152
generic.menu.flash.2097152_1048576.build.flash_length=1044480
generic.menu.flash.2097152_1048576.build.eeprom_start=270528512
generic.menu.flash.2097152_1048576.build.fs_start=269479936
generic.menu.flash.2097152_1048576.build.fs_end=270528512
generic.menu.flash.4194304_0=4MB (no FS)
generic.menu.flash.4194304_0.upload.maximum_size=4190208
generic.menu.flash.4194304_0.build.flash_total=4194304
generic.menu.flash.4194304_0.build.flash_length=4190208
generic.menu.flash.4194304_0.build.eeprom_start=272625664
generic.menu.flash.4194304_0.build.fs_start=272625664
generic.menu.flash.4194304_0.build.fs_end=272625664
generic.menu.flash.4194304_3145728=4MB (Sketch: 1MB, FS: 3MB)
generic.menu.flash.4194304_3145728.upload.maximum_size=1044480
generic.menu.flash.4194304_3145728.build.flash_total=4194304
generic.menu.flash.4194304_3145728.build.flash_length=1044480
generic.menu.flash.4194304_3145728.build.eeprom_start=272625664
generic.menu.flash.4194304_3145728.build.fs_start=269479936
generic.menu.flash.4194304_3145728.build.fs_end=272625664
generic.menu.flash.4194304_2097152=4MB (Sketch: 2MB, FS: 2MB)
generic.menu.flash.4194304_2097152.upload.maximum_size=2093056
generic.menu.flash.4194304_2097152.build.flash_total=4194304
generic.menu.flash.4194304_2097152.build.flash_length=2093056
generic.menu.flash.4194304_2097152.build.eeprom_start=272625664
generic.menu.flash.4194304_2097152.build.fs_start=270528512
generic.menu.flash.4194304_2097152.build.fs_end=272625664
generic.menu.flash.8388608_0=8MB (no FS)
generic.menu.flash.8388608_0.upload.maximum_size=8384512
generic.menu.flash.8388608_0.build.flash_total=8388608
generic.menu.flash.8388608_0.build.flash_length=8384512
generic.menu.flash.8388608_0.build.eeprom_start=276819968
generic.menu.flash.8388608_0.build.fs_start=276819968
generic.menu.flash.8388608_0.build.fs_end=276819968
generic.menu.flash.8388608_7340032=8MB (Sketch: 1MB, FS: 7MB)
generic.menu.flash.8388608_7340032.upload.maximum_size=1044480
generic.menu.flash.8388608_7340032.build.flash_total=8388608
generic.menu.flash.8388608_7340032.build.flash_length=1044480
generic.menu.flash.8388608_7340032.build.eeprom_start=276819968
generic.menu.flash.8388608_7340032.build.fs_start=269479936
generic.menu.flash.8388608_7340032.build.fs_end=276819968
generic.menu.flash.8388608_4194304=8MB (Sketch: 4MB, FS: 4MB)
generic.menu.flash.8388608_4194304.upload.maximum_size=4190208
generic.menu.flash.8388608_4194304.build.flash_total=8388608
generic.menu.flash.8388608_4194304.build.flash_length=4190208
generic.menu.flash.8388608_4194304.build.eeprom_start=276819968
generic.menu.flash.8388608_4194304.build.fs_start=272625664
generic.menu.flash.8388608_4194304.build.fs_end=276819968
generic.menu.flash.8388608_2097152=8MB (Sketch: 6MB, FS: 2MB)
generic.menu.flash.8388608_2097152.upload.maximum_size=6287360
generic.menu.flash.8388608_2097152.build.flash_total=8388608
generic.menu.flash.8388608_2097152.build.flash_length=6287360
generic.menu.flash.8388608_2097152.build.eeprom_start=276819968
generic.menu.flash.8388608_2097152.build.fs_start=274722816
generic.menu.flash.8388608_2097152.build.fs_end=276819968
generic.menu.flash.16777216_0=16MB (no FS)
generic.menu.flash.16777216_0.upload.maximum_size=16773120
generic.menu.flash.16777216_0.build.flash_total=16777216
generic.menu.flash.16777216_0.build.flash_length=16773120
generic.menu.flash.16777216_0.build.eeprom_start=285208576
generic.menu.flash.16777216_0.build.fs_start=285208576
generic.menu.flash.16777216_0.build.fs_end=285208576
generic.menu.flash.16777216_15728640=16MB (Sketch: 1MB, FS: 15MB)
generic.menu.flash.16777216_15728640.upload.maximum_size=1044480
generic.menu.flash.16777216_15728640.build.flash_total=16777216
generic.menu.flash.16777216_15728640.build.flash_length=1044480
generic.menu.flash.16777216_15728640.build.eeprom_start=285208576
generic.menu.flash.16777216_15728640.build.fs_start=269479936
generic.menu.flash.16777216_15728640.build.fs_end=285208576
generic.menu.flash.16777216_14680064=16MB (Sketch: 2MB, FS: 14MB)
generic.menu.flash.16777216_14680064.upload.maximum_size=2093056
generic.menu.flash.16777216_14680064.build.flash_total=16777216
generic.menu.flash.16777216_14680064.build.flash_length=2093056
generic.menu.flash.16777216_14680064.build.eeprom_start=285208576
generic.menu.flash.16777216_14680064.build.fs_start=270528512
generic.menu.flash.16777216_14680064.build.fs_end=285208576
generic.menu.flash.16777216_12582912=16MB (Sketch: 4MB, FS: 12MB)
generic.menu.flash.16777216_12582912.upload.maximum_size=4190208
generic.menu.flash.16777216_12582912.build.flash_total=16777216
generic.menu.flash.16777216_12582912.build.flash_length=4190208
generic.menu.flash.16777216_12582912.build.eeprom_start=285208576
generic.menu.flash.16777216_12582912.build.fs_start=272625664
generic.menu.flash.16777216_12582912.build.fs_end=285208576
generic.menu.flash.16777216_8388608=16MB (Sketch: 8MB, FS: 8MB)
generic.menu.flash.16777216_8388608.upload.maximum_size=8384512
generic.menu.flash.16777216_8388608.build.flash_total=16777216
generic.menu.flash.16777216_8388608.build.flash_length=8384512
generic.menu.flash.16777216_8388608.build.eeprom_start=285208576
generic.menu.flash.16777216_8388608.build.fs_start=276819968
generic.menu.flash.16777216_8388608.build.fs_end=285208576
generic.menu.flash.16777216_4194304=16MB (Sketch: 12MB, FS: 4MB)
generic.menu.flash.16777216_4194304.upload.maximum_size=12578816
generic.menu.flash.16777216_4194304.build.flash_total=16777216
generic.menu.flash.16777216_4194304.build.flash_length=12578816
generic.menu.flash.16777216_4194304.build.eeprom_start=285208576
generic.menu.flash.16777216_4194304.build.fs_start=281014272
generic.menu.flash.16777216_4194304.build.fs_end=285208576
generic.menu.flash.16777216_2097152=16MB (Sketch: 14MB, FS: 2MB)
generic.menu.flash.16777216_2097152.upload.maximum_size=14675968
generic.menu.flash.16777216_2097152.build.flash_total=16777216
generic.menu.flash.16777216_2097152.build.flash_length=14675968
generic.menu.flash.16777216_2097152.build.eeprom_start=285208576
generic.menu.flash.16777216_2097152.build.fs_start=283111424
generic.menu.flash.16777216_2097152.build.fs_end=285208576
generic.menu.freq.200=200 MHz
generic.menu.freq.200.build.f_cpu=200000000L
generic.menu.freq.50=50 MHz
generic.menu.freq.50.build.f_cpu=50000000L
generic.menu.freq.100=100 MHz
generic.menu.freq.100.build.f_cpu=100000000L
generic.menu.freq.120=120 MHz
generic.menu.freq.120.build.f_cpu=120000000L
generic.menu.freq.125=125 MHz
generic.menu.freq.125.build.f_cpu=125000000L
generic.menu.freq.128=128 MHz
generic.menu.freq.128.build.f_cpu=128000000L
generic.menu.freq.133=133 MHz
generic.menu.freq.133.build.f_cpu=133000000L
generic.menu.freq.150=150 MHz
generic.menu.freq.150.build.f_cpu=150000000L
generic.menu.freq.176=176 MHz
generic.menu.freq.176.build.f_cpu=176000000L
generic.menu.freq.225=225 MHz (Overclock)
generic.menu.freq.225.build.f_cpu=225000000L
generic.menu.freq.240=240 MHz (Overclock)
generic.menu.freq.240.build.f_cpu=240000000L
generic.menu.freq.250=250 MHz (Overclock)
generic.menu.freq.250.build.f_cpu=250000000L
generic.menu.freq.276=276 MHz (Overclock)
generic.menu.freq.276.build.f_cpu=276000000L
generic.menu.freq.300=300 MHz (Overclock)
generic.menu.freq.300.build.f_cpu=300000000L
generic.menu.opt.Small=Small (-Os) (standard)
generic.menu.opt.Small.build.flags.optimize=-Os
generic.menu.opt.Optimize=Optimize (-O)
generic.menu.opt.Optimize.build.flags.optimize=-O
generic.menu.opt.Optimize2=Optimize More (-O2)
generic.menu.opt.Optimize2.build.flags.optimize=-O2
generic.menu.opt.Optimize3=Optimize Even More (-O3)
generic.menu.opt.Optimize3.build.flags.optimize=-O3
generic.menu.opt.Fast=Fast (-Ofast) (maybe slower)
generic.menu.opt.Fast.build.flags.optimize=-Ofast
generic.menu.opt.Debug=Debug (-Og)
generic.menu.opt.Debug.build.flags.optimize=-Og
generic.menu.opt.Disabled=Disabled (-O0)
generic.menu.opt.Disabled.build.flags.optimize=-O0
generic.menu.os.none=None
generic.menu.os.none.build.os=
generic.menu.os.freertos=FreeRTOS SMP
generic.menu.os.freertos.build.os=-D__FREERTOS
generic.menu.profile.Disabled=Disabled
generic.menu.profile.Disabled.build.flags.profile=
generic.menu.profile.Enabled=Enabled
generic.menu.profile.Enabled.build.flags.profile=-pg -D__PROFILE
generic.menu.rtti.Disabled=Disabled
generic.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
generic.menu.rtti.Enabled=Enabled
generic.menu.rtti.Enabled.build.flags.rtti=
generic.menu.stackprotect.Disabled=Disabled
generic.menu.stackprotect.Disabled.build.flags.stackprotect=
generic.menu.stackprotect.Enabled=Enabled
generic.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector-all
generic.menu.exceptions.Disabled=Disabled
generic.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
generic.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
generic.menu.exceptions.Enabled=Enabled
generic.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
generic.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
generic.menu.dbgport.Disabled=Disabled
generic.menu.dbgport.Disabled.build.debug_port=
generic.menu.dbgport.Serial=Serial
generic.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
generic.menu.dbgport.Serial1=Serial1
generic.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
generic.menu.dbgport.Serial2=Serial2
generic.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
generic.menu.dbgport.SerialSemi=SerialSemi
generic.menu.dbgport.SerialSemi.build.debug_port=-DDEBUG_RP2040_PORT=SerialSemi
generic.menu.dbglvl.None=None
generic.menu.dbglvl.None.build.debug_level=
generic.menu.dbglvl.Core=Core
generic.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
generic.menu.dbglvl.SPI=SPI
generic.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
generic.menu.dbglvl.Wire=Wire
generic.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
generic.menu.dbglvl.Bluetooth=Bluetooth
generic.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
generic.menu.dbglvl.LWIP=LWIP
generic.menu.dbglvl.LWIP.build.debug_level=-DLWIP_DEBUG=1
generic.menu.dbglvl.All=All
generic.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH -DLWIP_DEBUG=1
generic.menu.dbglvl.NDEBUG=NDEBUG
generic.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
generic.menu.usbstack.picosdk=Pico SDK
generic.menu.usbstack.picosdk.build.usbstack_flags=
generic.menu.usbstack.tinyusb=Adafruit TinyUSB
generic.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
generic.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
generic.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
generic.menu.usbstack.nousb=No USB
generic.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
generic.menu.ipbtstack.ipv4only=IPv4 Only
generic.menu.ipbtstack.ipv4only.build.libpicow=liblwip.a
generic.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
generic.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
generic.menu.ipbtstack.ipv4ipv6.build.libpicow=liblwip.a
generic.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
generic.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
generic.menu.ipbtstack.ipv4btcble.build.libpicow=liblwip-bt.a
generic.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -DCYW43_ENABLE_BLUETOOTH=1
generic.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
generic.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=liblwip-bt.a
generic.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -DCYW43_ENABLE_BLUETOOTH=1
generic.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
generic.menu.ipbtstack.ipv4onlybig.build.libpicow=liblwip.a
generic.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
generic.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
generic.menu.ipbtstack.ipv4ipv6big.build.libpicow=liblwip.a
generic.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
generic.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
generic.menu.ipbtstack.ipv4btcblebig.build.libpicow=liblwip-bt.a
generic.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -DCYW43_ENABLE_BLUETOOTH=1 -D__LWIP_MEMMULT=2
generic.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
generic.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=liblwip-bt.a
generic.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -DCYW43_ENABLE_BLUETOOTH=1 -D__LWIP_MEMMULT=2
generic.menu.boot2.boot2_generic_03h_2_padded_checksum=Generic SPI /2
generic.menu.boot2.boot2_generic_03h_2_padded_checksum.build.boot2=boot2_generic_03h_2_padded_checksum
generic.menu.boot2.boot2_generic_03h_4_padded_checksum=Generic SPI /4
generic.menu.boot2.boot2_generic_03h_4_padded_checksum.build.boot2=boot2_generic_03h_4_padded_checksum
generic.menu.boot2.boot2_is25lp080_2_padded_checksum=IS25LP080 QSPI /2
generic.menu.boot2.boot2_is25lp080_2_padded_checksum.build.boot2=boot2_is25lp080_2_padded_checksum
generic.menu.boot2.boot2_is25lp080_4_padded_checksum=IS25LP080 QSPI /4
generic.menu.boot2.boot2_is25lp080_4_padded_checksum.build.boot2=boot2_is25lp080_4_padded_checksum
generic.menu.boot2.boot2_w25q080_2_padded_checksum=W25Q080 QSPI /2
