MARS-engineers/Robotrix-Board/boards.txt
# -----------------------------------
# MARS-Engineers Robotrix-Rover-One-V1
# -----------------------------------
robotrix_rover_one_v1.name=MARS-Engineers Robotrix-Rover-One-V1
robotrix_rover_one_v1.vid.0=0x2e8a
robotrix_rover_one_v1.pid.0=0xf00f
robotrix_rover_one_v1.vid.1=0x2e8a
robotrix_rover_one_v1.pid.1=0xf10f
robotrix_rover_one_v1.upload_port.0.vid=0x2e8a
robotrix_rover_one_v1.upload_port.0.pid=0xf00f
robotrix_rover_one_v1.upload_port.1.vid=0x2e8a
robotrix_rover_one_v1.upload_port.1.pid=0xf10f
robotrix_rover_one_v1.build.usbvid=-DUSBD_VID=0x2e8a
robotrix_rover_one_v1.build.usbpid=-DUSBD_PID=0xf00f
robotrix_rover_one_v1.build.usbpwr=-DUSBD_MAX_POWER_MA=250
robotrix_rover_one_v1.build.board=GENERIC_RP2040
robotrix_rover_one_v1.build.mcu=cortex-m0plus
robotrix_rover_one_v1.build.chip=rp2040
robotrix_rover_one_v1.build.toolchain=arm-none-eabi
robotrix_rover_one_v1.build.toolchainpkg=pqt-gcc
robotrix_rover_one_v1.build.toolchainopts=-march=armv6-m -mcpu=cortex-m0plus -mthumb
robotrix_rover_one_v1.build.uf2family=--family rp2040
robotrix_rover_one_v1.build.variant=robotrix_rover_one_v1
robotrix_rover_one_v1.upload.maximum_size=16777216
robotrix_rover_one_v1.upload.wait_for_upload_port=true
robotrix_rover_one_v1.upload.erase_cmd=
robotrix_rover_one_v1.serial.disableDTR=false
robotrix_rover_one_v1.serial.disableRTS=false
robotrix_rover_one_v1.build.f_cpu=125000000
robotrix_rover_one_v1.build.led=
robotrix_rover_one_v1.build.core=rp2040
robotrix_rover_one_v1.build.ldscript=memmap_default.ld
robotrix_rover_one_v1.build.boot2=none
robotrix_rover_one_v1.build.usb_manufacturer="MARS-Engineers"
robotrix_rover_one_v1.build.usb_product="Robotrix-Rover-One-V1"
robotrix_rover_one_v1.menu.flash.16777216_0=16MB (no FS)
robotrix_rover_one_v1.menu.flash.16777216_0.upload.maximum_size=16773120
robotrix_rover_one_v1.menu.flash.16777216_0.build.flash_total=16777216
robotrix_rover_one_v1.menu.flash.16777216_0.build.flash_length=16773120
robotrix_rover_one_v1.menu.flash.16777216_0.build.eeprom_start=285208576
robotrix_rover_one_v1.menu.flash.16777216_0.build.fs_start=285208576
robotrix_rover_one_v1.menu.flash.16777216_0.build.fs_end=285208576
robotrix_rover_one_v1.menu.flash.16777216_65536=16MB (Sketch: 16320KB, FS: 64KB)
robotrix_rover_one_v1.menu.flash.16777216_65536.upload.maximum_size=16707584
robotrix_rover_one_v1.menu.flash.16777216_65536.build.flash_total=16777216
robotrix_rover_one_v1.menu.flash.16777216_65536.build.flash_length=16707584
robotrix_rover_one_v1.menu.flash.16777216_65536.build.eeprom_start=285208576
robotrix_rover_one_v1.menu.flash.16777216_65536.build.fs_start=285143040
robotrix_rover_one_v1.menu.flash.16777216_65536.build.fs_end=285208576
robotrix_rover_one_v1.menu.flash.16777216_131072=16MB (Sketch: 16256KB, FS: 128KB)
robotrix_rover_one_v1.menu.flash.16777216_131072.upload.maximum_size=16642048
robotrix_rover_one_v1.menu.flash.16777216_131072.build.flash_total=16777216
robotrix_rover_one_v1.menu.flash.16777216_131072.build.flash_length=16642048
robotrix_rover_one_v1.menu.flash.16777216_131072.build.eeprom_start=285208576
robotrix_rover_one_v1.menu.flash.16777216_131072.build.fs_start=285077504
robotrix_rover_one_v1.menu.flash.16777216_131072.build.fs_end=285208576
robotrix_rover_one_v1.menu.flash.16777216_262144=16MB (Sketch: 16128KB, FS: 256KB)
robotrix_rover_one_v1.menu.flash.16777216_262144.upload.maximum_size=16510976
robotrix_rover_one_v1.menu.flash.16777216_262144.build.flash_total=16777216
robotrix_rover_one_v1.menu.flash.16777216_262144.build.flash_length=16510976
robotrix_rover_one_v1.menu.flash.16777216_262144.build.eeprom_start=285208576
robotrix_rover_one_v1.menu.flash.16777216_262144.build.fs_start=284946432
robotrix_rover_one_v1.menu.flash.16777216_262144.build.fs_end=285208576
robotrix_rover_one_v1.menu.flash.16777216_524288=16MB (Sketch: 15872KB, FS: 512KB)
robotrix_rover_one_v1.menu.flash.16777216_524288.upload.maximum_size=16248832
robotrix_rover_one_v1.menu.flash.16777216_524288.build.flash_total=16777216
robotrix_rover_one_v1.menu.flash.16777216_524288.build.flash_length=16248832
robotrix_rover_one_v1.menu.flash.16777216_524288.build.eeprom_start=285208576
robotrix_rover_one_v1.menu.flash.16777216_524288.build.fs_start=284684288
robotrix_rover_one_v1.menu.flash.16777216_524288.build.fs_end=285208576
robotrix_rover_one_v1.menu.flash.16777216_1048576=16MB (Sketch: 15MB, FS: 1MB)
robotrix_rover_one_v1.menu.flash.16777216_1048576.upload.maximum_size=15724544
robotrix_rover_one_v1.menu.flash.16777216_1048576.build.flash_total=16777216
robotrix_rover_one_v1.menu.flash.16777216_1048576.build.flash_length=15724544
robotrix_rover_one_v1.menu.flash.16777216_1048576.build.eeprom_start=285208576
robotrix_rover_one_v1.menu.flash.16777216_1048576.build.fs_start=284160000
robotrix_rover_one_v1.menu.flash.16777216_1048576.build.fs_end=285208576
robotrix_rover_one_v1.menu.flash.16777216_2097152=16MB (Sketch: 14MB, FS: 2MB)
robotrix_rover_one_v1.menu.flash.16777216_2097152.upload.maximum_size=14675968
robotrix_rover_one_v1.menu.flash.16777216_2097152.build.flash_total=16777216
robotrix_rover_one_v1.menu.flash.16777216_2097152.build.flash_length=14675968
robotrix_rover_one_v1.menu.flash.16777216_2097152.build.eeprom_start=285208576
robotrix_rover_one_v1.menu.flash.16777216_2097152.build.fs_start=283111424
robotrix_rover_one_v1.menu.flash.16777216_2097152.build.fs_end=285208576
robotrix_rover_one_v1.menu.flash.16777216_3145728=16MB (Sketch: 13MB, FS: 3MB)
robotrix_rover_one_v1.menu.flash.16777216_3145728.upload.maximum_size=13627392
robotrix_rover_one_v1.menu.flash.16777216_3145728.build.flash_total=16777216
robotrix_rover_one_v1.menu.flash.16777216_3145728.build.flash_length=13627392
robotrix_rover_one_v1.menu.flash.16777216_3145728.build.eeprom_start=285208576
robotrix_rover_one_v1.menu.flash.16777216_3145728.build.fs_start=282062848
robotrix_rover_one_v1.menu.flash.16777216_3145728.build.fs_end=285208576
robotrix_rover_one_v1.menu.flash.16777216_4194304=16MB (Sketch: 12MB, FS: 4MB)
robotrix_rover_one_v1.menu.flash.16777216_4194304.upload.maximum_size=12578816
robotrix_rover_one_v1.menu.flash.16777216_4194304.build.flash_total=16777216
robotrix_rover_one_v1.menu.flash.16777216_4194304.build.flash_length=12578816
robotrix_rover_one_v1.menu.flash.16777216_4194304.build.eeprom_start=285208576
robotrix_rover_one_v1.menu.flash.16777216_4194304.build.fs_start=281014272
robotrix_rover_one_v1.menu.flash.16777216_4194304.build.fs_end=285208576
robotrix_rover_one_v1.menu.flash.16777216_5242880=16MB (Sketch: 11MB, FS: 5MB)
robotrix_rover_one_v1.menu.flash.16777216_5242880.upload.maximum_size=11530240
robotrix_rover_one_v1.menu.flash.16777216_5242880.build.flash_total=16777216
robotrix_rover_one_v1.menu.flash.16777216_5242880.build.flash_length=11530240
robotrix_rover_one_v1.menu.flash.16777216_5242880.build.eeprom_start=285208576
robotrix_rover_one_v1.menu.flash.16777216_5242880.build.fs_start=279965696
robotrix_rover_one_v1.menu.flash.16777216_5242880.build.fs_end=285208576
robotrix_rover_one_v1.menu.flash.16777216_6291456=16MB (Sketch: 10MB, FS: 6MB)
robotrix_rover_one_v1.menu.flash.16777216_6291456.upload.maximum_size=10481664
robotrix_rover_one_v1.menu.flash.16777216_6291456.build.flash_total=16777216
robotrix_rover_one_v1.menu.flash.16777216_6291456.build.flash_length=10481664
robotrix_rover_one_v1.menu.flash.16777216_6291456.build.eeprom_start=285208576
robotrix_rover_one_v1.menu.flash.16777216_6291456.build.fs_start=278917120
robotrix_rover_one_v1.menu.flash.16777216_6291456.build.fs_end=285208576
robotrix_rover_one_v1.menu.flash.16777216_7340032=16MB (Sketch: 9MB, FS: 7MB)
robotrix_rover_one_v1.menu.flash.16777216_7340032.upload.maximum_size=9433088
robotrix_rover_one_v1.menu.flash.16777216_7340032.build.flash_total=16777216
robotrix_rover_one_v1.menu.flash.16777216_7340032.build.flash_length=9433088
robotrix_rover_one_v1.menu.flash.16777216_7340032.build.eeprom_start=285208576
robotrix_rover_one_v1.menu.flash.16777216_7340032.build.fs_start=277868544
robotrix_rover_one_v1.menu.flash.16777216_7340032.build.fs_end=285208576
robotrix_rover_one_v1.menu.flash.16777216_8388608=16MB (Sketch: 8MB, FS: 8MB)
robotrix_rover_one_v1.menu.flash.16777216_8388608.upload.maximum_size=8384512
robotrix_rover_one_v1.menu.flash.16777216_8388608.build.flash_total=16777216
robotrix_rover_one_v1.menu.flash.16777216_8388608.build.flash_length=8384512
robotrix_rover_one_v1.menu.flash.16777216_8388608.build.eeprom_start=285208576
robotrix_rover_one_v1.menu.flash.16777216_8388608.build.fs_start=276819968
robotrix_rover_one_v1.menu.flash.16777216_8388608.build.fs_end=285208576
robotrix_rover_one_v1.menu.flash.16777216_9437184=16MB (Sketch: 7MB, FS: 9MB)
robotrix_rover_one_v1.menu.flash.16777216_9437184.upload.maximum_size=7335936
robotrix_rover_one_v1.menu.flash.16777216_9437184.build.flash_total=16777216
robotrix_rover_one_v1.menu.flash.16777216_9437184.build.flash_length=7335936
robotrix_rover_one_v1.menu.flash.16777216_9437184.build.eeprom_start=285208576
robotrix_rover_one_v1.menu.flash.16777216_9437184.build.fs_start=275771392
robotrix_rover_one_v1.menu.flash.16777216_9437184.build.fs_end=285208576
robotrix_rover_one_v1.menu.flash.16777216_10485760=16MB (Sketch: 6MB, FS: 10MB)
robotrix_rover_one_v1.menu.flash.16777216_10485760.upload.maximum_size=6287360
robotrix_rover_one_v1.menu.flash.16777216_10485760.build.flash_total=16777216
robotrix_rover_one_v1.menu.flash.16777216_10485760.build.flash_length=6287360
robotrix_rover_one_v1.menu.flash.16777216_10485760.build.eeprom_start=285208576
robotrix_rover_one_v1.menu.flash.16777216_10485760.build.fs_start=274722816
robotrix_rover_one_v1.menu.flash.16777216_10485760.build.fs_end=285208576
robotrix_rover_one_v1.menu.flash.16777216_11534336=16MB (Sketch: 5MB, FS: 11MB)
robotrix_rover_one_v1.menu.flash.16777216_11534336.upload.maximum_size=5238784
robotrix_rover_one_v1.menu.flash.16777216_11534336.build.flash_total=16777216
robotrix_rover_one_v1.menu.flash.16777216_11534336.build.flash_length=5238784
robotrix_rover_one_v1.menu.flash.16777216_11534336.build.eeprom_start=285208576
robotrix_rover_one_v1.menu.flash.16777216_11534336.build.fs_start=273674240
robotrix_rover_one_v1.menu.flash.16777216_11534336.build.fs_end=285208576
robotrix_rover_one_v1.menu.flash.16777216_12582912=16MB (Sketch: 4MB, FS: 12MB)
robotrix_rover_one_v1.menu.flash.16777216_12582912.upload.maximum_size=4190208
robotrix_rover_one_v1.menu.flash.16777216_12582912.build.flash_total=16777216
robotrix_rover_one_v1.menu.flash.16777216_12582912.build.flash_length=4190208
robotrix_rover_one_v1.menu.flash.16777216_12582912.build.eeprom_start=285208576
robotrix_rover_one_v1.menu.flash.16777216_12582912.build.fs_start=272625664
robotrix_rover_one_v1.menu.flash.16777216_12582912.build.fs_end=285208576
robotrix_rover_one_v1.menu.flash.16777216_13631488=16MB (Sketch: 3MB, FS: 13MB)
robotrix_rover_one_v1.menu.flash.16777216_13631488.upload.maximum_size=3141632
robotrix_rover_one_v1.menu.flash.16777216_13631488.build.flash_total=16777216
robotrix_rover_one_v1.menu.flash.16777216_13631488.build.flash_length=3141632
robotrix_rover_one_v1.menu.flash.16777216_13631488.build.eeprom_start=285208576
robotrix_rover_one_v1.menu.flash.16777216_13631488.build.fs_start=271577088
robotrix_rover_one_v1.menu.flash.16777216_13631488.build.fs_end=285208576
robotrix_rover_one_v1.menu.flash.16777216_14680064=16MB (Sketch: 2MB, FS: 14MB)
robotrix_rover_one_v1.menu.flash.16777216_14680064.upload.maximum_size=2093056
robotrix_rover_one_v1.menu.flash.16777216_14680064.build.flash_total=16777216
robotrix_rover_one_v1.menu.flash.16777216_14680064.build.flash_length=2093056
robotrix_rover_one_v1.menu.flash.16777216_14680064.build.eeprom_start=285208576
robotrix_rover_one_v1.menu.flash.16777216_14680064.build.fs_start=270528512
robotrix_rover_one_v1.menu.flash.16777216_14680064.build.fs_end=285208576
robotrix_rover_one_v1.menu.flash.16777216_15728640=16MB (Sketch: 1MB, FS: 15MB)
robotrix_rover_one_v1.menu.flash.16777216_15728640.upload.maximum_size=1044480
robotrix_rover_one_v1.menu.flash.16777216_15728640.build.flash_total=16777216
robotrix_rover_one_v1.menu.flash.16777216_15728640.build.flash_length=1044480
robotrix_rover_one_v1.menu.flash.16777216_15728640.build.eeprom_start=285208576
robotrix_rover_one_v1.menu.flash.16777216_15728640.build.fs_start=269479936
robotrix_rover_one_v1.menu.flash.16777216_15728640.build.fs_end=285208576
robotrix_rover_one_v1.menu.freq.200=200 MHz
robotrix_rover_one_v1.menu.freq.200.build.f_cpu=200000000L
robotrix_rover_one_v1.menu.freq.50=50 MHz
robotrix_rover_one_v1.menu.freq.50.build.f_cpu=50000000L
robotrix_rover_one_v1.menu.freq.100=100 MHz
robotrix_rover_one_v1.menu.freq.100.build.f_cpu=100000000L
robotrix_rover_one_v1.menu.freq.120=120 MHz
robotrix_rover_one_v1.menu.freq.120.build.f_cpu=120000000L
robotrix_rover_one_v1.menu.freq.125=125 MHz
robotrix_rover_one_v1.menu.freq.125.build.f_cpu=125000000L
robotrix_rover_one_v1.menu.freq.128=128 MHz
robotrix_rover_one_v1.menu.freq.128.build.f_cpu=128000000L
robotrix_rover_one_v1.menu.freq.133=133 MHz
robotrix_rover_one_v1.menu.freq.133.build.f_cpu=133000000L
robotrix_rover_one_v1.menu.freq.150=150 MHz
robotrix_rover_one_v1.menu.freq.150.build.f_cpu=150000000L
robotrix_rover_one_v1.menu.freq.176=176 MHz
robotrix_rover_one_v1.menu.freq.176.build.f_cpu=176000000L
robotrix_rover_one_v1.menu.freq.225=225 MHz (Overclock)
robotrix_rover_one_v1.menu.freq.225.build.f_cpu=225000000L
robotrix_rover_one_v1.menu.freq.240=240 MHz (Overclock)
robotrix_rover_one_v1.menu.freq.240.build.f_cpu=240000000L
robotrix_rover_one_v1.menu.freq.250=250 MHz (Overclock)
robotrix_rover_one_v1.menu.freq.250.build.f_cpu=250000000L
robotrix_rover_one_v1.menu.freq.276=276 MHz (Overclock)
robotrix_rover_one_v1.menu.freq.276.build.f_cpu=276000000L
robotrix_rover_one_v1.menu.freq.300=300 MHz (Overclock)
robotrix_rover_one_v1.menu.freq.300.build.f_cpu=300000000L
robotrix_rover_one_v1.menu.opt.Small=Small (-Os) (standard)
robotrix_rover_one_v1.menu.opt.Small.build.flags.optimize=-Os
robotrix_rover_one_v1.menu.opt.Optimize=Optimize (-O)
robotrix_rover_one_v1.menu.opt.Optimize.build.flags.optimize=-O
robotrix_rover_one_v1.menu.opt.Optimize2=Optimize More (-O2)
robotrix_rover_one_v1.menu.opt.Optimize2.build.flags.optimize=-O2
robotrix_rover_one_v1.menu.opt.Optimize3=Optimize Even More (-O3)
robotrix_rover_one_v1.menu.opt.Optimize3.build.flags.optimize=-O3
robotrix_rover_one_v1.menu.opt.Fast=Fast (-Ofast) (maybe slower)
robotrix_rover_one_v1.menu.opt.Fast.build.flags.optimize=-Ofast
robotrix_rover_one_v1.menu.opt.Debug=Debug (-Og)
robotrix_rover_one_v1.menu.opt.Debug.build.flags.optimize=-Og
robotrix_rover_one_v1.menu.opt.Disabled=Disabled (-O0)
robotrix_rover_one_v1.menu.opt.Disabled.build.flags.optimize=-O0
robotrix_rover_one_v1.menu.os.none=None
robotrix_rover_one_v1.menu.os.none.build.os=
robotrix_rover_one_v1.menu.os.freertos=FreeRTOS SMP
robotrix_rover_one_v1.menu.os.freertos.build.os=-D__FREERTOS
robotrix_rover_one_v1.menu.profile.Disabled=Disabled
robotrix_rover_one_v1.menu.profile.Disabled.build.flags.profile=
robotrix_rover_one_v1.menu.profile.Enabled=Enabled
robotrix_rover_one_v1.menu.profile.Enabled.build.flags.profile=-pg -D__PROFILE
robotrix_rover_one_v1.menu.rtti.Disabled=Disabled
robotrix_rover_one_v1.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
robotrix_rover_one_v1.menu.rtti.Enabled=Enabled
robotrix_rover_one_v1.menu.rtti.Enabled.build.flags.rtti=
robotrix_rover_one_v1.menu.stackprotect.Disabled=Disabled
robotrix_rover_one_v1.menu.stackprotect.Disabled.build.flags.stackprotect=
robotrix_rover_one_v1.menu.stackprotect.Enabled=Enabled
robotrix_rover_one_v1.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector-all
robotrix_rover_one_v1.menu.exceptions.Disabled=Disabled
robotrix_rover_one_v1.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
robotrix_rover_one_v1.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
robotrix_rover_one_v1.menu.exceptions.Enabled=Enabled
robotrix_rover_one_v1.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
robotrix_rover_one_v1.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
robotrix_rover_one_v1.menu.dbgport.Disabled=Disabled
robotrix_rover_one_v1.menu.dbgport.Disabled.build.debug_port=
robotrix_rover_one_v1.menu.dbgport.Serial=Serial
robotrix_rover_one_v1.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
robotrix_rover_one_v1.menu.dbgport.Serial1=Serial1
robotrix_rover_one_v1.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
robotrix_rover_one_v1.menu.dbgport.Serial2=Serial2
robotrix_rover_one_v1.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
robotrix_rover_one_v1.menu.dbgport.SerialSemi=SerialSemi
robotrix_rover_one_v1.menu.dbgport.SerialSemi.build.debug_port=-DDEBUG_RP2040_PORT=SerialSemi
robotrix_rover_one_v1.menu.dbglvl.None=None
robotrix_rover_one_v1.menu.dbglvl.None.build.debug_level=
robotrix_rover_one_v1.menu.dbglvl.Core=Core
robotrix_rover_one_v1.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
robotrix_rover_one_v1.menu.dbglvl.SPI=SPI
robotrix_rover_one_v1.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
robotrix_rover_one_v1.menu.dbglvl.Wire=Wire
robotrix_rover_one_v1.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
robotrix_rover_one_v1.menu.dbglvl.Bluetooth=Bluetooth
robotrix_rover_one_v1.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
robotrix_rover_one_v1.menu.dbglvl.LWIP=LWIP
robotrix_rover_one_v1.menu.dbglvl.LWIP.build.debug_level=-DLWIP_DEBUG=1
robotrix_rover_one_v1.menu.dbglvl.All=All
robotrix_rover_one_v1.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH -DLWIP_DEBUG=1
robotrix_rover_one_v1.menu.dbglvl.NDEBUG=NDEBUG
robotrix_rover_one_v1.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
robotrix_rover_one_v1.menu.usbstack.picosdk=Pico SDK
