MARS-engineers/Robotrix-Board/boards.txt
robotrix_rover_one_v1.menu.usbstack.picosdk.build.usbstack_flags=
robotrix_rover_one_v1.menu.usbstack.tinyusb=Adafruit TinyUSB
robotrix_rover_one_v1.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
robotrix_rover_one_v1.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
robotrix_rover_one_v1.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
robotrix_rover_one_v1.menu.usbstack.nousb=No USB
robotrix_rover_one_v1.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
robotrix_rover_one_v1.menu.ipbtstack.ipv4only=IPv4 Only
robotrix_rover_one_v1.menu.ipbtstack.ipv4only.build.libpicow=liblwip.a
robotrix_rover_one_v1.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
robotrix_rover_one_v1.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
robotrix_rover_one_v1.menu.ipbtstack.ipv4ipv6.build.libpicow=liblwip.a
robotrix_rover_one_v1.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
robotrix_rover_one_v1.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
robotrix_rover_one_v1.menu.ipbtstack.ipv4btcble.build.libpicow=liblwip-bt.a
robotrix_rover_one_v1.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -DCYW43_ENABLE_BLUETOOTH=1
robotrix_rover_one_v1.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
robotrix_rover_one_v1.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=liblwip-bt.a
robotrix_rover_one_v1.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -DCYW43_ENABLE_BLUETOOTH=1
robotrix_rover_one_v1.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
robotrix_rover_one_v1.menu.ipbtstack.ipv4onlybig.build.libpicow=liblwip.a
robotrix_rover_one_v1.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
robotrix_rover_one_v1.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
robotrix_rover_one_v1.menu.ipbtstack.ipv4ipv6big.build.libpicow=liblwip.a
robotrix_rover_one_v1.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
robotrix_rover_one_v1.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
robotrix_rover_one_v1.menu.ipbtstack.ipv4btcblebig.build.libpicow=liblwip-bt.a
robotrix_rover_one_v1.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -DCYW43_ENABLE_BLUETOOTH=1 -D__LWIP_MEMMULT=2
robotrix_rover_one_v1.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
robotrix_rover_one_v1.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=liblwip-bt.a
robotrix_rover_one_v1.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -DCYW43_ENABLE_BLUETOOTH=1 -D__LWIP_MEMMULT=2
robotrix_rover_one_v1.menu.uploadmethod.default=Default (UF2)
robotrix_rover_one_v1.menu.uploadmethod.default.build.ram_length=256k
robotrix_rover_one_v1.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
robotrix_rover_one_v1.menu.uploadmethod.default.upload.maximum_data_size=262144
robotrix_rover_one_v1.menu.uploadmethod.default.upload.tool=uf2conv
robotrix_rover_one_v1.menu.uploadmethod.default.upload.tool.default=uf2conv
robotrix_rover_one_v1.menu.uploadmethod.default.upload.tool.network=uf2conv-network
robotrix_rover_one_v1.menu.uploadmethod.picotool=Picotool
robotrix_rover_one_v1.menu.uploadmethod.picotool.build.ram_length=256k
robotrix_rover_one_v1.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
robotrix_rover_one_v1.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
robotrix_rover_one_v1.menu.uploadmethod.picotool.upload.maximum_data_size=262144
robotrix_rover_one_v1.menu.uploadmethod.picotool.upload.tool=picotool
robotrix_rover_one_v1.menu.uploadmethod.picotool.upload.tool.default=picotool
robotrix_rover_one_v1.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe/Debugprobe (CMSIS-DAP)
robotrix_rover_one_v1.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=256k
robotrix_rover_one_v1.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
robotrix_rover_one_v1.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=262144
robotrix_rover_one_v1.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
robotrix_rover_one_v1.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap

# -----------------------------------
# MARS-Engineers Robotrix-Rover-One-V2
# -----------------------------------
robotrix_rover_one_v2.name=MARS-Engineers Robotrix-Rover-One-V2
robotrix_rover_one_v2.vid.0=0x2e8a
robotrix_rover_one_v2.pid.0=0xf00f
robotrix_rover_one_v2.vid.1=0x2e8a
robotrix_rover_one_v2.pid.1=0xf10f
robotrix_rover_one_v2.upload_port.0.vid=0x2e8a
robotrix_rover_one_v2.upload_port.0.pid=0xf00f
robotrix_rover_one_v2.upload_port.1.vid=0x2e8a
robotrix_rover_one_v2.upload_port.1.pid=0xf10f
robotrix_rover_one_v2.build.usbvid=-DUSBD_VID=0x2e8a
robotrix_rover_one_v2.build.usbpid=-DUSBD_PID=0xf00f
robotrix_rover_one_v2.build.usbpwr=-DUSBD_MAX_POWER_MA=250
robotrix_rover_one_v2.build.board=GENERIC_RP2350
robotrix_rover_one_v2.build.variant=robotrix_rover_one_v2
robotrix_rover_one_v2.upload.maximum_size=16777216
robotrix_rover_one_v2.upload.wait_for_upload_port=true
robotrix_rover_one_v2.upload.erase_cmd=
robotrix_rover_one_v2.serial.disableDTR=false
robotrix_rover_one_v2.serial.disableRTS=false
robotrix_rover_one_v2.build.f_cpu=125000000
robotrix_rover_one_v2.build.led=
robotrix_rover_one_v2.build.core=rp2040
robotrix_rover_one_v2.build.ldscript=memmap_default.ld
robotrix_rover_one_v2.build.boot2=none
robotrix_rover_one_v2.build.usb_manufacturer="MARS-Engineers"
robotrix_rover_one_v2.build.usb_product="Robotrix-Rover-One-V2"
robotrix_rover_one_v2.build.psram_length=0x800000
robotrix_rover_one_v2.menu.flash.16777216_0=16MB (no FS)
robotrix_rover_one_v2.menu.flash.16777216_0.upload.maximum_size=16769024
robotrix_rover_one_v2.menu.flash.16777216_0.build.flash_total=16777216
robotrix_rover_one_v2.menu.flash.16777216_0.build.flash_length=16769024
robotrix_rover_one_v2.menu.flash.16777216_0.build.eeprom_start=285204480
robotrix_rover_one_v2.menu.flash.16777216_0.build.fs_start=285204480
robotrix_rover_one_v2.menu.flash.16777216_0.build.fs_end=285204480
robotrix_rover_one_v2.menu.flash.16777216_65536=16MB (Sketch: 16320KB, FS: 64KB)
robotrix_rover_one_v2.menu.flash.16777216_65536.upload.maximum_size=16703488
robotrix_rover_one_v2.menu.flash.16777216_65536.build.flash_total=16777216
robotrix_rover_one_v2.menu.flash.16777216_65536.build.flash_length=16703488
robotrix_rover_one_v2.menu.flash.16777216_65536.build.eeprom_start=285204480
robotrix_rover_one_v2.menu.flash.16777216_65536.build.fs_start=285138944
robotrix_rover_one_v2.menu.flash.16777216_65536.build.fs_end=285204480
robotrix_rover_one_v2.menu.flash.16777216_131072=16MB (Sketch: 16256KB, FS: 128KB)
robotrix_rover_one_v2.menu.flash.16777216_131072.upload.maximum_size=16637952
robotrix_rover_one_v2.menu.flash.16777216_131072.build.flash_total=16777216
robotrix_rover_one_v2.menu.flash.16777216_131072.build.flash_length=16637952
robotrix_rover_one_v2.menu.flash.16777216_131072.build.eeprom_start=285204480
robotrix_rover_one_v2.menu.flash.16777216_131072.build.fs_start=285073408
robotrix_rover_one_v2.menu.flash.16777216_131072.build.fs_end=285204480
robotrix_rover_one_v2.menu.flash.16777216_262144=16MB (Sketch: 16128KB, FS: 256KB)
robotrix_rover_one_v2.menu.flash.16777216_262144.upload.maximum_size=16506880
robotrix_rover_one_v2.menu.flash.16777216_262144.build.flash_total=16777216
robotrix_rover_one_v2.menu.flash.16777216_262144.build.flash_length=16506880
robotrix_rover_one_v2.menu.flash.16777216_262144.build.eeprom_start=285204480
robotrix_rover_one_v2.menu.flash.16777216_262144.build.fs_start=284942336
robotrix_rover_one_v2.menu.flash.16777216_262144.build.fs_end=285204480
robotrix_rover_one_v2.menu.flash.16777216_524288=16MB (Sketch: 15872KB, FS: 512KB)
robotrix_rover_one_v2.menu.flash.16777216_524288.upload.maximum_size=16244736
robotrix_rover_one_v2.menu.flash.16777216_524288.build.flash_total=16777216
robotrix_rover_one_v2.menu.flash.16777216_524288.build.flash_length=16244736
robotrix_rover_one_v2.menu.flash.16777216_524288.build.eeprom_start=285204480
robotrix_rover_one_v2.menu.flash.16777216_524288.build.fs_start=284680192
robotrix_rover_one_v2.menu.flash.16777216_524288.build.fs_end=285204480
robotrix_rover_one_v2.menu.flash.16777216_1048576=16MB (Sketch: 15MB, FS: 1MB)
robotrix_rover_one_v2.menu.flash.16777216_1048576.upload.maximum_size=15720448
robotrix_rover_one_v2.menu.flash.16777216_1048576.build.flash_total=16777216
robotrix_rover_one_v2.menu.flash.16777216_1048576.build.flash_length=15720448
robotrix_rover_one_v2.menu.flash.16777216_1048576.build.eeprom_start=285204480
robotrix_rover_one_v2.menu.flash.16777216_1048576.build.fs_start=284155904
robotrix_rover_one_v2.menu.flash.16777216_1048576.build.fs_end=285204480
robotrix_rover_one_v2.menu.flash.16777216_2097152=16MB (Sketch: 14MB, FS: 2MB)
robotrix_rover_one_v2.menu.flash.16777216_2097152.upload.maximum_size=14671872
robotrix_rover_one_v2.menu.flash.16777216_2097152.build.flash_total=16777216
robotrix_rover_one_v2.menu.flash.16777216_2097152.build.flash_length=14671872
robotrix_rover_one_v2.menu.flash.16777216_2097152.build.eeprom_start=285204480
robotrix_rover_one_v2.menu.flash.16777216_2097152.build.fs_start=283107328
robotrix_rover_one_v2.menu.flash.16777216_2097152.build.fs_end=285204480
robotrix_rover_one_v2.menu.flash.16777216_3145728=16MB (Sketch: 13MB, FS: 3MB)
robotrix_rover_one_v2.menu.flash.16777216_3145728.upload.maximum_size=13623296
robotrix_rover_one_v2.menu.flash.16777216_3145728.build.flash_total=16777216
robotrix_rover_one_v2.menu.flash.16777216_3145728.build.flash_length=13623296
robotrix_rover_one_v2.menu.flash.16777216_3145728.build.eeprom_start=285204480
robotrix_rover_one_v2.menu.flash.16777216_3145728.build.fs_start=282058752
robotrix_rover_one_v2.menu.flash.16777216_3145728.build.fs_end=285204480
robotrix_rover_one_v2.menu.flash.16777216_4194304=16MB (Sketch: 12MB, FS: 4MB)
robotrix_rover_one_v2.menu.flash.16777216_4194304.upload.maximum_size=12574720
robotrix_rover_one_v2.menu.flash.16777216_4194304.build.flash_total=16777216
robotrix_rover_one_v2.menu.flash.16777216_4194304.build.flash_length=12574720
robotrix_rover_one_v2.menu.flash.16777216_4194304.build.eeprom_start=285204480
robotrix_rover_one_v2.menu.flash.16777216_4194304.build.fs_start=281010176
robotrix_rover_one_v2.menu.flash.16777216_4194304.build.fs_end=285204480
robotrix_rover_one_v2.menu.flash.16777216_5242880=16MB (Sketch: 11MB, FS: 5MB)
robotrix_rover_one_v2.menu.flash.16777216_5242880.upload.maximum_size=11526144
robotrix_rover_one_v2.menu.flash.16777216_5242880.build.flash_total=16777216
robotrix_rover_one_v2.menu.flash.16777216_5242880.build.flash_length=11526144
robotrix_rover_one_v2.menu.flash.16777216_5242880.build.eeprom_start=285204480
robotrix_rover_one_v2.menu.flash.16777216_5242880.build.fs_start=279961600
robotrix_rover_one_v2.menu.flash.16777216_5242880.build.fs_end=285204480
robotrix_rover_one_v2.menu.flash.16777216_6291456=16MB (Sketch: 10MB, FS: 6MB)
robotrix_rover_one_v2.menu.flash.16777216_6291456.upload.maximum_size=10477568
robotrix_rover_one_v2.menu.flash.16777216_6291456.build.flash_total=16777216
robotrix_rover_one_v2.menu.flash.16777216_6291456.build.flash_length=10477568
robotrix_rover_one_v2.menu.flash.16777216_6291456.build.eeprom_start=285204480
robotrix_rover_one_v2.menu.flash.16777216_6291456.build.fs_start=278913024
robotrix_rover_one_v2.menu.flash.16777216_6291456.build.fs_end=285204480
robotrix_rover_one_v2.menu.flash.16777216_7340032=16MB (Sketch: 9MB, FS: 7MB)
robotrix_rover_one_v2.menu.flash.16777216_7340032.upload.maximum_size=9428992
robotrix_rover_one_v2.menu.flash.16777216_7340032.build.flash_total=16777216
robotrix_rover_one_v2.menu.flash.16777216_7340032.build.flash_length=9428992
robotrix_rover_one_v2.menu.flash.16777216_7340032.build.eeprom_start=285204480
robotrix_rover_one_v2.menu.flash.16777216_7340032.build.fs_start=277864448
robotrix_rover_one_v2.menu.flash.16777216_7340032.build.fs_end=285204480
robotrix_rover_one_v2.menu.flash.16777216_8388608=16MB (Sketch: 8MB, FS: 8MB)
robotrix_rover_one_v2.menu.flash.16777216_8388608.upload.maximum_size=8380416
robotrix_rover_one_v2.menu.flash.16777216_8388608.build.flash_total=16777216
robotrix_rover_one_v2.menu.flash.16777216_8388608.build.flash_length=8380416
robotrix_rover_one_v2.menu.flash.16777216_8388608.build.eeprom_start=285204480
robotrix_rover_one_v2.menu.flash.16777216_8388608.build.fs_start=276815872
robotrix_rover_one_v2.menu.flash.16777216_8388608.build.fs_end=285204480
robotrix_rover_one_v2.menu.flash.16777216_9437184=16MB (Sketch: 7MB, FS: 9MB)
robotrix_rover_one_v2.menu.flash.16777216_9437184.upload.maximum_size=7331840
robotrix_rover_one_v2.menu.flash.16777216_9437184.build.flash_total=16777216
robotrix_rover_one_v2.menu.flash.16777216_9437184.build.flash_length=7331840
robotrix_rover_one_v2.menu.flash.16777216_9437184.build.eeprom_start=285204480
robotrix_rover_one_v2.menu.flash.16777216_9437184.build.fs_start=275767296
robotrix_rover_one_v2.menu.flash.16777216_9437184.build.fs_end=285204480
robotrix_rover_one_v2.menu.flash.16777216_10485760=16MB (Sketch: 6MB, FS: 10MB)
robotrix_rover_one_v2.menu.flash.16777216_10485760.upload.maximum_size=6283264
robotrix_rover_one_v2.menu.flash.16777216_10485760.build.flash_total=16777216
robotrix_rover_one_v2.menu.flash.16777216_10485760.build.flash_length=6283264
robotrix_rover_one_v2.menu.flash.16777216_10485760.build.eeprom_start=285204480
robotrix_rover_one_v2.menu.flash.16777216_10485760.build.fs_start=274718720
robotrix_rover_one_v2.menu.flash.16777216_10485760.build.fs_end=285204480
robotrix_rover_one_v2.menu.flash.16777216_11534336=16MB (Sketch: 5MB, FS: 11MB)
robotrix_rover_one_v2.menu.flash.16777216_11534336.upload.maximum_size=5234688
robotrix_rover_one_v2.menu.flash.16777216_11534336.build.flash_total=16777216
robotrix_rover_one_v2.menu.flash.16777216_11534336.build.flash_length=5234688
robotrix_rover_one_v2.menu.flash.16777216_11534336.build.eeprom_start=285204480
robotrix_rover_one_v2.menu.flash.16777216_11534336.build.fs_start=273670144
robotrix_rover_one_v2.menu.flash.16777216_11534336.build.fs_end=285204480
robotrix_rover_one_v2.menu.flash.16777216_12582912=16MB (Sketch: 4MB, FS: 12MB)
robotrix_rover_one_v2.menu.flash.16777216_12582912.upload.maximum_size=4186112
robotrix_rover_one_v2.menu.flash.16777216_12582912.build.flash_total=16777216
robotrix_rover_one_v2.menu.flash.16777216_12582912.build.flash_length=4186112
robotrix_rover_one_v2.menu.flash.16777216_12582912.build.eeprom_start=285204480
robotrix_rover_one_v2.menu.flash.16777216_12582912.build.fs_start=272621568
robotrix_rover_one_v2.menu.flash.16777216_12582912.build.fs_end=285204480
robotrix_rover_one_v2.menu.flash.16777216_13631488=16MB (Sketch: 3MB, FS: 13MB)
robotrix_rover_one_v2.menu.flash.16777216_13631488.upload.maximum_size=3137536
robotrix_rover_one_v2.menu.flash.16777216_13631488.build.flash_total=16777216
robotrix_rover_one_v2.menu.flash.16777216_13631488.build.flash_length=3137536
robotrix_rover_one_v2.menu.flash.16777216_13631488.build.eeprom_start=285204480
robotrix_rover_one_v2.menu.flash.16777216_13631488.build.fs_start=271572992
robotrix_rover_one_v2.menu.flash.16777216_13631488.build.fs_end=285204480
robotrix_rover_one_v2.menu.flash.16777216_14680064=16MB (Sketch: 2MB, FS: 14MB)
robotrix_rover_one_v2.menu.flash.16777216_14680064.upload.maximum_size=2088960
robotrix_rover_one_v2.menu.flash.16777216_14680064.build.flash_total=16777216
robotrix_rover_one_v2.menu.flash.16777216_14680064.build.flash_length=2088960
robotrix_rover_one_v2.menu.flash.16777216_14680064.build.eeprom_start=285204480
robotrix_rover_one_v2.menu.flash.16777216_14680064.build.fs_start=270524416
robotrix_rover_one_v2.menu.flash.16777216_14680064.build.fs_end=285204480
robotrix_rover_one_v2.menu.flash.16777216_15728640=16MB (Sketch: 1MB, FS: 15MB)
robotrix_rover_one_v2.menu.flash.16777216_15728640.upload.maximum_size=1040384
robotrix_rover_one_v2.menu.flash.16777216_15728640.build.flash_total=16777216
robotrix_rover_one_v2.menu.flash.16777216_15728640.build.flash_length=1040384
robotrix_rover_one_v2.menu.flash.16777216_15728640.build.eeprom_start=285204480
robotrix_rover_one_v2.menu.flash.16777216_15728640.build.fs_start=269475840
robotrix_rover_one_v2.menu.flash.16777216_15728640.build.fs_end=285204480
robotrix_rover_one_v2.menu.arch.arm=ARM
robotrix_rover_one_v2.menu.arch.arm.build.chip=rp2350
robotrix_rover_one_v2.menu.arch.arm.build.toolchain=arm-none-eabi
robotrix_rover_one_v2.menu.arch.arm.build.toolchainpkg=pqt-gcc
robotrix_rover_one_v2.menu.arch.arm.build.toolchainopts=-mcpu=cortex-m33 -mthumb -march=armv8-m.main+fp+dsp -mfloat-abi=softfp -mcmse
robotrix_rover_one_v2.menu.arch.arm.build.uf2family=--family rp2350-arm-s --abs-block
robotrix_rover_one_v2.menu.arch.arm.build.mcu=cortex-m33
robotrix_rover_one_v2.menu.arch.riscv=RISC-V
robotrix_rover_one_v2.menu.arch.riscv.build.chip=rp2350-riscv
robotrix_rover_one_v2.menu.arch.riscv.build.toolchain=riscv32-unknown-elf
robotrix_rover_one_v2.menu.arch.riscv.build.toolchainpkg=pqt-gcc-riscv
robotrix_rover_one_v2.menu.arch.riscv.build.toolchainopts=-march=rv32imac_zicsr_zifencei_zba_zbb_zbs_zbkb -mabi=ilp32
robotrix_rover_one_v2.menu.arch.riscv.build.uf2family=--family rp2350-riscv --abs-block
robotrix_rover_one_v2.menu.arch.riscv.build.mcu=rv32imac
robotrix_rover_one_v2.menu.freq.150=150 MHz
robotrix_rover_one_v2.menu.freq.150.build.f_cpu=150000000L
robotrix_rover_one_v2.menu.freq.50=50 MHz
robotrix_rover_one_v2.menu.freq.50.build.f_cpu=50000000L
