MARS-engineers/Robotrix-Board/boards.txt
robotrix_rover_one_v2.menu.freq.100=100 MHz
robotrix_rover_one_v2.menu.freq.100.build.f_cpu=100000000L
robotrix_rover_one_v2.menu.freq.120=120 MHz
robotrix_rover_one_v2.menu.freq.120.build.f_cpu=120000000L
robotrix_rover_one_v2.menu.freq.125=125 MHz
robotrix_rover_one_v2.menu.freq.125.build.f_cpu=125000000L
robotrix_rover_one_v2.menu.freq.128=128 MHz
robotrix_rover_one_v2.menu.freq.128.build.f_cpu=128000000L
robotrix_rover_one_v2.menu.freq.133=133 MHz
robotrix_rover_one_v2.menu.freq.133.build.f_cpu=133000000L
robotrix_rover_one_v2.menu.freq.176=176 MHz (Overclock)
robotrix_rover_one_v2.menu.freq.176.build.f_cpu=176000000L
robotrix_rover_one_v2.menu.freq.200=200 MHz (Overclock)
robotrix_rover_one_v2.menu.freq.200.build.f_cpu=200000000L
robotrix_rover_one_v2.menu.freq.225=225 MHz (Overclock)
robotrix_rover_one_v2.menu.freq.225.build.f_cpu=225000000L
robotrix_rover_one_v2.menu.freq.240=240 MHz (Overclock)
robotrix_rover_one_v2.menu.freq.240.build.f_cpu=240000000L
robotrix_rover_one_v2.menu.freq.250=250 MHz (Overclock)
robotrix_rover_one_v2.menu.freq.250.build.f_cpu=250000000L
robotrix_rover_one_v2.menu.freq.276=276 MHz (Overclock)
robotrix_rover_one_v2.menu.freq.276.build.f_cpu=276000000L
robotrix_rover_one_v2.menu.freq.300=300 MHz (Overclock)
robotrix_rover_one_v2.menu.freq.300.build.f_cpu=300000000L
robotrix_rover_one_v2.menu.opt.Small=Small (-Os) (standard)
robotrix_rover_one_v2.menu.opt.Small.build.flags.optimize=-Os
robotrix_rover_one_v2.menu.opt.Optimize=Optimize (-O)
robotrix_rover_one_v2.menu.opt.Optimize.build.flags.optimize=-O
robotrix_rover_one_v2.menu.opt.Optimize2=Optimize More (-O2)
robotrix_rover_one_v2.menu.opt.Optimize2.build.flags.optimize=-O2
robotrix_rover_one_v2.menu.opt.Optimize3=Optimize Even More (-O3)
robotrix_rover_one_v2.menu.opt.Optimize3.build.flags.optimize=-O3
robotrix_rover_one_v2.menu.opt.Fast=Fast (-Ofast) (maybe slower)
robotrix_rover_one_v2.menu.opt.Fast.build.flags.optimize=-Ofast
robotrix_rover_one_v2.menu.opt.Debug=Debug (-Og)
robotrix_rover_one_v2.menu.opt.Debug.build.flags.optimize=-Og
robotrix_rover_one_v2.menu.opt.Disabled=Disabled (-O0)
robotrix_rover_one_v2.menu.opt.Disabled.build.flags.optimize=-O0
robotrix_rover_one_v2.menu.os.none=None
robotrix_rover_one_v2.menu.os.none.build.os=
robotrix_rover_one_v2.menu.os.freertos=FreeRTOS SMP
robotrix_rover_one_v2.menu.os.freertos.build.os=-D__FREERTOS
robotrix_rover_one_v2.menu.profile.Disabled=Disabled
robotrix_rover_one_v2.menu.profile.Disabled.build.flags.profile=
robotrix_rover_one_v2.menu.profile.Enabled=Enabled
robotrix_rover_one_v2.menu.profile.Enabled.build.flags.profile=-pg -D__PROFILE
robotrix_rover_one_v2.menu.rtti.Disabled=Disabled
robotrix_rover_one_v2.menu.rtti.Disabled.build.flags.rtti=-fno-rtti
robotrix_rover_one_v2.menu.rtti.Enabled=Enabled
robotrix_rover_one_v2.menu.rtti.Enabled.build.flags.rtti=
robotrix_rover_one_v2.menu.stackprotect.Disabled=Disabled
robotrix_rover_one_v2.menu.stackprotect.Disabled.build.flags.stackprotect=
robotrix_rover_one_v2.menu.stackprotect.Enabled=Enabled
robotrix_rover_one_v2.menu.stackprotect.Enabled.build.flags.stackprotect=-fstack-protector-all
robotrix_rover_one_v2.menu.exceptions.Disabled=Disabled
robotrix_rover_one_v2.menu.exceptions.Disabled.build.flags.exceptions=-fno-exceptions
robotrix_rover_one_v2.menu.exceptions.Disabled.build.flags.libstdcpp=-lstdc++
robotrix_rover_one_v2.menu.exceptions.Enabled=Enabled
robotrix_rover_one_v2.menu.exceptions.Enabled.build.flags.exceptions=-fexceptions
robotrix_rover_one_v2.menu.exceptions.Enabled.build.flags.libstdcpp=-lstdc++-exc
robotrix_rover_one_v2.menu.dbgport.Disabled=Disabled
robotrix_rover_one_v2.menu.dbgport.Disabled.build.debug_port=
robotrix_rover_one_v2.menu.dbgport.Serial=Serial
robotrix_rover_one_v2.menu.dbgport.Serial.build.debug_port=-DDEBUG_RP2040_PORT=Serial
robotrix_rover_one_v2.menu.dbgport.Serial1=Serial1
robotrix_rover_one_v2.menu.dbgport.Serial1.build.debug_port=-DDEBUG_RP2040_PORT=Serial1
robotrix_rover_one_v2.menu.dbgport.Serial2=Serial2
robotrix_rover_one_v2.menu.dbgport.Serial2.build.debug_port=-DDEBUG_RP2040_PORT=Serial2
robotrix_rover_one_v2.menu.dbgport.SerialSemi=SerialSemi
robotrix_rover_one_v2.menu.dbgport.SerialSemi.build.debug_port=-DDEBUG_RP2040_PORT=SerialSemi
robotrix_rover_one_v2.menu.dbglvl.None=None
robotrix_rover_one_v2.menu.dbglvl.None.build.debug_level=
robotrix_rover_one_v2.menu.dbglvl.Core=Core
robotrix_rover_one_v2.menu.dbglvl.Core.build.debug_level=-DDEBUG_RP2040_CORE
robotrix_rover_one_v2.menu.dbglvl.SPI=SPI
robotrix_rover_one_v2.menu.dbglvl.SPI.build.debug_level=-DDEBUG_RP2040_SPI
robotrix_rover_one_v2.menu.dbglvl.Wire=Wire
robotrix_rover_one_v2.menu.dbglvl.Wire.build.debug_level=-DDEBUG_RP2040_WIRE
robotrix_rover_one_v2.menu.dbglvl.Bluetooth=Bluetooth
robotrix_rover_one_v2.menu.dbglvl.Bluetooth.build.debug_level=-DDEBUG_RP2040_BLUETOOTH
robotrix_rover_one_v2.menu.dbglvl.LWIP=LWIP
robotrix_rover_one_v2.menu.dbglvl.LWIP.build.debug_level=-DLWIP_DEBUG=1
robotrix_rover_one_v2.menu.dbglvl.All=All
robotrix_rover_one_v2.menu.dbglvl.All.build.debug_level=-DDEBUG_RP2040_WIRE -DDEBUG_RP2040_SPI -DDEBUG_RP2040_CORE -DDEBUG_RP2040_BLUETOOTH -DLWIP_DEBUG=1
robotrix_rover_one_v2.menu.dbglvl.NDEBUG=NDEBUG
robotrix_rover_one_v2.menu.dbglvl.NDEBUG.build.debug_level=-DNDEBUG
robotrix_rover_one_v2.menu.usbstack.picosdk=Pico SDK
robotrix_rover_one_v2.menu.usbstack.picosdk.build.usbstack_flags=
robotrix_rover_one_v2.menu.usbstack.tinyusb=Adafruit TinyUSB
robotrix_rover_one_v2.menu.usbstack.tinyusb.build.usbstack_flags=-DUSE_TINYUSB "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
robotrix_rover_one_v2.menu.usbstack.tinyusb_host=Adafruit TinyUSB Host (native)
robotrix_rover_one_v2.menu.usbstack.tinyusb_host.build.usbstack_flags=-DUSE_TINYUSB -DUSE_TINYUSB_HOST "-I{runtime.platform.path}/libraries/Adafruit_TinyUSB_Arduino/src/arduino"
robotrix_rover_one_v2.menu.usbstack.nousb=No USB
robotrix_rover_one_v2.menu.usbstack.nousb.build.usbstack_flags="-DNO_USB -DDISABLE_USB_SERIAL -I{runtime.platform.path}/tools/libpico"
robotrix_rover_one_v2.menu.ipbtstack.ipv4only=IPv4 Only
robotrix_rover_one_v2.menu.ipbtstack.ipv4only.build.libpicow=liblwip.a
robotrix_rover_one_v2.menu.ipbtstack.ipv4only.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1
robotrix_rover_one_v2.menu.ipbtstack.ipv4ipv6=IPv4 + IPv6
robotrix_rover_one_v2.menu.ipbtstack.ipv4ipv6.build.libpicow=liblwip.a
robotrix_rover_one_v2.menu.ipbtstack.ipv4ipv6.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1
robotrix_rover_one_v2.menu.ipbtstack.ipv4btcble=IPv4 + Bluetooth
robotrix_rover_one_v2.menu.ipbtstack.ipv4btcble.build.libpicow=liblwip-bt.a
robotrix_rover_one_v2.menu.ipbtstack.ipv4btcble.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -DCYW43_ENABLE_BLUETOOTH=1
robotrix_rover_one_v2.menu.ipbtstack.ipv4ipv6btcble=IPv4 + IPv6 + Bluetooth
robotrix_rover_one_v2.menu.ipbtstack.ipv4ipv6btcble.build.libpicow=liblwip-bt.a
robotrix_rover_one_v2.menu.ipbtstack.ipv4ipv6btcble.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -DCYW43_ENABLE_BLUETOOTH=1
robotrix_rover_one_v2.menu.ipbtstack.ipv4onlybig=IPv4 Only - 32K
robotrix_rover_one_v2.menu.ipbtstack.ipv4onlybig.build.libpicow=liblwip.a
robotrix_rover_one_v2.menu.ipbtstack.ipv4onlybig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
robotrix_rover_one_v2.menu.ipbtstack.ipv4ipv6big=IPv4 + IPv6 - 32K
robotrix_rover_one_v2.menu.ipbtstack.ipv4ipv6big.build.libpicow=liblwip.a
robotrix_rover_one_v2.menu.ipbtstack.ipv4ipv6big.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -D__LWIP_MEMMULT=2
robotrix_rover_one_v2.menu.ipbtstack.ipv4btcblebig=IPv4 + Bluetooth - 32K
robotrix_rover_one_v2.menu.ipbtstack.ipv4btcblebig.build.libpicow=liblwip-bt.a
robotrix_rover_one_v2.menu.ipbtstack.ipv4btcblebig.build.libpicowdefs=-DLWIP_IPV6=0 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -DCYW43_ENABLE_BLUETOOTH=1 -D__LWIP_MEMMULT=2
robotrix_rover_one_v2.menu.ipbtstack.ipv4ipv6btcblebig=IPv4 + IPv6 + Bluetooth - 32K
robotrix_rover_one_v2.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicow=liblwip-bt.a
robotrix_rover_one_v2.menu.ipbtstack.ipv4ipv6btcblebig.build.libpicowdefs=-DLWIP_IPV6=1 -DLWIP_IPV4=1 -DENABLE_CLASSIC=1 -DENABLE_BLE=1 -DCYW43_ENABLE_BLUETOOTH=1 -D__LWIP_MEMMULT=2
robotrix_rover_one_v2.menu.uploadmethod.default=Default (UF2)
robotrix_rover_one_v2.menu.uploadmethod.default.build.ram_length=512k
robotrix_rover_one_v2.menu.uploadmethod.default.build.debugscript=picoprobe_cmsis_dap.tcl
robotrix_rover_one_v2.menu.uploadmethod.default.upload.maximum_data_size=524288
robotrix_rover_one_v2.menu.uploadmethod.default.upload.tool=uf2conv
robotrix_rover_one_v2.menu.uploadmethod.default.upload.tool.default=uf2conv
robotrix_rover_one_v2.menu.uploadmethod.default.upload.tool.network=uf2conv-network
robotrix_rover_one_v2.menu.uploadmethod.picotool=Picotool
robotrix_rover_one_v2.menu.uploadmethod.picotool.build.ram_length=512k
robotrix_rover_one_v2.menu.uploadmethod.picotool.build.debugscript=picoprobe.tcl
robotrix_rover_one_v2.menu.uploadmethod.picotool.build.picodebugflags=-DENABLE_PICOTOOL_USB
robotrix_rover_one_v2.menu.uploadmethod.picotool.upload.maximum_data_size=524288
robotrix_rover_one_v2.menu.uploadmethod.picotool.upload.tool=picotool
robotrix_rover_one_v2.menu.uploadmethod.picotool.upload.tool.default=picotool
robotrix_rover_one_v2.menu.uploadmethod.picoprobe_cmsis_dap=Picoprobe/Debugprobe (CMSIS-DAP)
robotrix_rover_one_v2.menu.uploadmethod.picoprobe_cmsis_dap.build.ram_length=512k
robotrix_rover_one_v2.menu.uploadmethod.picoprobe_cmsis_dap.build.debugscript=picoprobe_cmsis_dap.tcl
robotrix_rover_one_v2.menu.uploadmethod.picoprobe_cmsis_dap.upload.maximum_data_size=524288
robotrix_rover_one_v2.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool=picoprobe_cmsis_dap
robotrix_rover_one_v2.menu.uploadmethod.picoprobe_cmsis_dap.upload.tool.default=picoprobe_cmsis_dap
